// Задача 64:

// Задайте значение N. Напишите программу, которая выведет все
// натуральные числа в промежутке от N до 1.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// Выполнить с помощью рекурсии.

// Данное задание повторяет задание 63


//////////////////////////////////////////////////////////////
/// Методы предыдущих занятий
//////////////////////////////////////////////////////////////

// Метод ввода данных
int ReadData(string msg)
{
    System.Console.WriteLine(msg);
    int num = int.Parse(System.Console.ReadLine() ?? "0");
    return num;
}

// Метод вывода результата
void PrintRezult(string msg)
{
    System.Console.WriteLine(msg);
}

//////////////////////////////////////////////////////////////
/// Методы текущего задания 
//////////////////////////////////////////////////////////////

// Рекурсивный метод вывода чисел от 1 до N
string GenLineNum(int num)
{
    string str = "";
    if (num >= 1)
    str = num + ", " + GenLineNum(num - 1);
        
    return str;
}


//////////////////////////////////////////////////////////////
/// Тело программы
//////////////////////////////////////////////////////////////

int num = ReadData("Введите число");

PrintRezult("N = " + num + " -> " + GenLineNum(num));