// Задача 66:

// Задайте значения M и N. Напишите программу, которая
// найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

//////////////////////////////////////////////////////////////
/// Методы предыдущих занятий
//////////////////////////////////////////////////////////////

// Метод ввода данных
int ReadData(string msg)
{
    System.Console.WriteLine(msg);
    int num = int.Parse(System.Console.ReadLine() ?? "0");
    return num;
}

// Метод вывода результата
void PrintRezult(string msg)
{
    System.Console.WriteLine(msg);
}

//////////////////////////////////////////////////////////////
/// Методы текущего задания 
//////////////////////////////////////////////////////////////

// Рекурсивный метод суммирвания чисел от M до N
int SumNumRec(int m, int n)
{
    if (n == m)
        return m;
    else
        return m + SumNumRec(m + 1, n);
}


//////////////////////////////////////////////////////////////
/// Тело программы
//////////////////////////////////////////////////////////////

int m = ReadData("Введите число M : ");
int n = ReadData("Введите число N : ");

PrintRezult("M = " + m + ", N = " + n + ", -> " + SumNumRec(m, n));